; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	image0 - mode
	spectrograph3 - mode
	spectrograph1 - mode
	image2 - mode
	image4 - mode
	Star0 - direction
	Star2 - direction
	Star3 - direction
	Star1 - direction
	Planet4 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument2 image0)
	(supports instrument2 image2)
	(calibration_target instrument2 Star2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument3 image4)
	(supports instrument3 image0)
	(calibration_target instrument3 Star3)
	(supports instrument4 image4)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star2)
	(supports instrument5 spectrograph3)
	(supports instrument5 spectrograph1)
	(supports instrument5 image0)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument6 spectrograph1)
	(supports instrument6 image2)
	(calibration_target instrument6 Star1)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet4)
	(supports instrument7 image4)
	(supports instrument7 image2)
	(calibration_target instrument7 Star1)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star6)
)
(:goal (and
	(pointing satellite2 Star7)
	(pointing satellite4 Star7)
	(have_image Planet4 spectrograph1)
	(have_image Planet5 image0)
	(have_image Star6 image0)
	(have_image Star7 image4)
	(have_image Planet8 image4)
	(have_image Star9 image0)
	(have_image Planet10 spectrograph1)
	(have_image Star11 image0)
	(have_image Star12 image2)
	(have_image Phenomenon13 spectrograph1)
	(have_image Planet14 spectrograph1)
	(have_image Phenomenon15 image2)
	(have_image Planet16 spectrograph1)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 1 of 15
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 1 of 15
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 15
4. (calibrate satellite1 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 1 of 15
5. (turn_to satellite4 planet8 star6)
   deleted: (pointing satellite4 star6)
   added: (pointing satellite4 planet8)
   goals met: 1 of 15
6. (turn_to satellite4 star1 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 star1)
   goals met: 1 of 15
7. (calibrate satellite4 instrument7 star1)
   added: (calibrated instrument7)
   goals met: 1 of 15
8. (turn_to satellite4 phenomenon15 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 phenomenon15)
   goals met: 1 of 15
9. (take_image satellite4 phenomenon15 instrument7 image2)
   added: (have_image phenomenon15 image2)
   goals met: 2 of 15
10. (turn_to satellite4 planet8 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 planet8)
   goals met: 2 of 15
11. (take_image satellite4 planet8 instrument7 image4)
   added: (have_image planet8 image4)
   goals met: 3 of 15
12. (turn_to satellite4 star12 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 star12)
   goals met: 3 of 15
13. (take_image satellite4 star12 instrument7 image2)
   added: (have_image star12 image2)
   goals met: 4 of 15
14. (turn_to satellite4 star7 star12)
   deleted: (pointing satellite4 star12)
   added: (pointing satellite4 star7)
   goals met: 5 of 15
15. (take_image satellite4 star7 instrument7 image4)
   added: (have_image star7 image4)
   goals met: 6 of 15
16. (turn_to satellite3 star1 planet4)
   deleted: (pointing satellite3 planet4)
   added: (pointing satellite3 star1)
   goals met: 6 of 15
17. (calibrate satellite3 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 6 of 15
18. (turn_to satellite3 phenomenon13 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 phenomenon13)
   goals met: 6 of 15
19. (take_image satellite3 phenomenon13 instrument6 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 7 of 15
20. (turn_to satellite3 planet10 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 planet10)
   goals met: 7 of 15
21. (take_image satellite3 planet10 instrument6 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 8 of 15
22. (turn_to satellite3 planet14 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 planet14)
   goals met: 8 of 15
23. (take_image satellite3 planet14 instrument6 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 9 of 15
24. (turn_to satellite3 planet16 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 planet16)
   goals met: 9 of 15
25. (take_image satellite3 planet16 instrument6 spectrograph1)
   added: (have_image planet16 spectrograph1)
   goals met: 10 of 15
26. (turn_to satellite3 planet4 planet16)
   deleted: (pointing satellite3 planet16)
   added: (pointing satellite3 planet4)
   goals met: 10 of 15
27. (take_image satellite3 planet4 instrument6 spectrograph1)
   added: (have_image planet4 spectrograph1)
   goals met: 11 of 15
28. (turn_to satellite1 planet5 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet5)
   goals met: 11 of 15
29. (take_image satellite1 planet5 instrument2 image0)
   added: (have_image planet5 image0)
   goals met: 12 of 15
30. (turn_to satellite1 star11 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star11)
   goals met: 12 of 15
31. (take_image satellite1 star11 instrument2 image0)
   added: (have_image star11 image0)
   goals met: 13 of 15
32. (turn_to satellite1 star6 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star6)
   goals met: 13 of 15
33. (take_image satellite1 star6 instrument2 image0)
   added: (have_image star6 image0)
   goals met: 14 of 15
34. (turn_to satellite1 star9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star9)
   goals met: 14 of 15
35. (take_image satellite1 star9 instrument2 image0)
   added: (have_image star9 image0)
   goals met: 15 of 15
